require("concat")
require("timezone")
-- 死亡時メッセージ
return function(map, characterManager, enemyManager)
  local chara = characterManager:getCurrentCharacter():getName()
  local mapId = map:getIdentifier()
  local currentTimeZone = getCurrentTimeZone()

  --死亡時（全ステージ共通部分）
  local commonPattern =  {
    string.format("%sは　とうとう　しんでしまった", chara), -- ${chara}とか書いてあるのは使えないので、この行と同じ感じに書き換えてください
    "おお${chara}よ　しんでしまうとは　なさけない",
    "${chara}は　みちなかばで　おわった",
    "うんが　わるかったに　ちがいない",
    "むねん　......！",
    "ぐわぁぁぁ！",
    "ざんねん！　${chara}のぼうけんは　ここでおわって　しまった",
    "${chara}の　ぼうけんは　ここまでだった",
    "CONTINUE?",
    "${chara}は　にどと　おきあがることは　なかった",
    "${chara}の　めのまえは　まっくらになった",
    "はいカットー",
    "そのご　${chara}の　すがたを　みたものは　いない",
    "${chara}の　だんまつまが　ひびきわたった",
    "${chara}は　たべられて　しまった",
    "ゆうしゃ　${chara}　ここにねむる",
    "こんなに　がんばったのに　......なぜ",
    "だめだった",
    "あんそくのち　グランエターナは　とおい",
    "まわりの　おとが　とおのく　......",
    "まものたちの　おたけびを　ききつつ　はてた",
    "いぬと　くらげは　つよいぞ",
    "なぜ　やられてしまったのか　......",
    "${chara}は　ちからつきた......",
    "......　ざんねんだったな",
    "ざんねん　むねん　もういっかい",
    "じんせいの　まくが　とじた",
    "${chara}は　おわって　しまった",
    "うんが　わるかったに　ちがいない",
    "ぐふっ。",
    "${chara}は　むごたらしく　なった",
    "これは　ひどい",
    "くちおしい　......ちくしょー！",
    "―　Ｋ　Ｏ　―",
    "もはや、ここまでか…",
    "こんなところで　まけてしまうのか......",
    "${chara}ーーーーーー！",
    "${chara}は　くちはてた",
    "そ、そんなバカなぁー！",
    "おしいひとを　うしなってしまった",
    "どうして　こうなった",
    "${chara}はほろびぬ！　なんどでも　よみがえるさ",
    "お　おぼえてろー",
    "うわーん",
    "だが　だいに　だいさんの　${chara}が　......かならず",
    "こんなところで　くちるなんて　もったいない",
    "${chara}のなきがらは　まものたちが　おいしくいただきました",
    "どういうこと　だってばよ......",
    "わがしょうがいに　いっぺんのくい　なし",
    "べ　べつにあんたのために　やられたわけじゃないんだからね",
    "か......　かてない......　だと",
    "もっと　がんばれ！　きみなら　できる",
    "ゆだん　たいてき",
    "てきは　のこりたいりょくで　いろが　かわるぞ",
    "おお......　かみよ......　どうして......",
    "どんまい",
    "アーッ!",
    "しにました",
    "どん・まい　❤",
    "まだ、まけるわけには　......！",
    "な、なんという、ていたらく！",
    "おつかれさまでした",
    "あ　やられた",
    "ざんねーん",
    "ヤラレチャッタ",
    "ばたんきゅ～......",
    "がめおべらー",
    "( ﾟдﾟ )",
    "そして　でんせつへ",
    "${chara}せんせいの　じかいさくに　ごきたいください",
    "うつくしく　はかなく　ちった",
    "かちそこねた",
    "ちめいしょう",
    "だめぽ",
    "Noooooooooo!!",
    "ＣＭ　はいりまーす",
    "ごめいふくを　おいのりします",
    "めげるな！　がんばれ！",
    "やっちゃったゼ",
    "まものめぇ　おのれぇ",
    "まものは　364の　けいけんちを　てにいれた",
    "${chara}！　へんじをしろ　${chara}ーーーーー！",
    "いま　あなたは　まものに　たおされました",
    "ごめんよ..エリザ...　エリザってだれよぉぉ！",
    "さいき　ふのう　－リタイア－",
    "${chara}は　ないたり　わらったり　できなくなった",
    "${chara}は　いよいよもって　しんだ",
    "ご　りんじゅう",
    "むこうに　おはなばたけが　みえます",
    "${chara}！　おうとうしろ　${chara}ーーーーー！"
  }

  return concat(commonPattern, (function()
    --各ステージ部分

    --1a
    if mapId == "1a_simple" then
      return {
        "だいじょうぶ　すこしずつ　なれていこう",
        "",
        "",
        "チュートリアルは　みてくれた？",
        "まあ　そういうことも　あるさ",
      }
    end

    --1b昼
    if mapId == "1b_field" and currentTimeZone == 0 then
      return {
        "さすがハード　ひとすじなわでは　いかないってかんじ？",
        "まさか　いきなりハードを　えらんだのでは？",
        "おいおい　こんなのまだ　じょのくち　だぜ？",
        "あまくみては　いけないな...",
        "しょうしょう　あそびすぎたか",
      }
    end

    --2a
    if mapId == "2a_forest" then
      return {
        "やられても　くじけるな",
        "めげずに　がんばって",
        "もういちど　ちょうせんしよう",
        "パワーチャージを　つかってみよう",
        "",
      }
    end

    --2b
    if mapId == "2b_cave" then
      return {
        "くらいよー　せまいよー　こわいよー",
        "ぐぅ．．．さすが　てごわい",
        "",
        "",
        "",
      }
    end

    --2c
    if mapId == "2c_cyber" then
      return {
        "こんなの　できねーよー",
        "むずかしいよう",
        "さすが　ハード．．．がくっ",
        "シールドだけじゃ　さばききれない",
        "",
      }
    end

    --3a
    if mapId == "3a_ruin" then
      return {
        "",
        "",
        "",
        "",
        "",
      }
    end

    --3b
    if mapId == "3b_castle" then
      return {
        "",
        "",
        "",
        "",
        "",
      }
    end

    --3c
    if mapId == "3c_ocean" then
      return {
        "",
        "",
        "",
        "",
        "",
      }
    end

    --3d
    if mapId == "3d_space" then
      return {
        "うちゅうの　もくずと　きえた",
        "",
        "",
        "",
        "",
      }
    end

    --1b夕暮れ
    if mapId == "1b_field" and currentTimeZone == 1 then
      return {
        "たそがれに　しずむ",
        "",
        "",
        "",
        "",
      }
    end

    --１ｂ夜
    if mapId == "1b_field" and currentTimeZone == 2 then
      return {
        "",
        "",
        "",
        "",
        "",
      }
    end
  end
  )())
end
